app/controllers/tweets_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find_by(id: params[:id])

INSERT INTO "tweets" ("comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "heloo yaartt"], ["user_id", 3], ["created_at", "2020-05-27 22:11:49.106698"], ["updated_at", "2020-05-27 22:11:49.106698"]]
---
  def create
  	if tweet_params[:comment]
	    @tweet = current_user.tweets.create!(tweet_params)

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tweets" SET "comment" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["comment", "meow"], ["updated_at", "2020-05-28 05:53:33.522659"], ["id", 6]]
---
  def update
    if @authorised_user
    	@tweet = Tweet.find_by(id: params[:id])
    	@tweet.update_attributes(tweet_params)

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 3]]
---
  def destroy
    if @authorised_user
			@tweet = Tweet.find_by(id: params[:id])
    	@tweet.update_attributes(tweet_params)
    	@tweet.delete

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."id" = $2  [["user_id", 3], ["id", 6]]
---
  def validate_access
  	if current_user.is_admin
  		@authorised_user = true
  	else
  		@authorised_user = current_user.tweets.where(id: params[:id]).present? ? true : false