app/controllers/users_controller.rb

  def authenticate(email, password)
    auth_token = AuthenticateUser.call(email, password)

    if auth_token.success?
      user = User.find_by_email(email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "navamipr@gmail.com"], ["LIMIT", 1]]